### START

### PANDAS PYTHON LIBRARY
- This practice set contains 40 tasks each task is refered as T

### ðŸŸ¦ SECTION 1 â€” DATA LOADING & DATAFRAME BASICS (8 Practical Tasks)

### IMPORTING PANDAS LIBRARY

In [1]:
import pandas as pd
import numpy as np

T1. Load a CSV file named employees.csv into a DataFrame and display the top 12 rows.

In [38]:
df1=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\employees.csv")
df1.head(12)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20
5,203,Susan,Mavris,SMAVRIS,515.123.7777,07-Jun-02,HR_REP,6500,-,101,40
6,204,Hermann,Baer,HBAER,515.123.8888,07-Jun-02,PR_REP,10000,-,101,70
7,205,Shelley,Higgins,SHIGGINS,515.123.8080,07-Jun-02,AC_MGR,12008,-,101,110
8,206,William,Gietz,WGIETZ,515.123.8181,07-Jun-02,AC_ACCOUNT,8300,-,205,110
9,100,Steven,King,SKING,515.123.4567,17-Jun-03,AD_PRES,24000,-,-,90
10,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-Sep-05,AD_VP,17000,-,100,90
11,102,Lex,De Haan,LDEHAAN,515.123.4569,13-Jan-01,AD_VP,17000,-,100,90

T2. Display:
- ï‚· row count
- ï‚· column count
- ï‚· data types
- ï‚· missing value count per column

In [25]:
df1.shape

(50, 11)

In [26]:
df1.dtypes

EMPLOYEE_ID        int64
FIRST_NAME        object
LAST_NAME         object
EMAIL             object
PHONE_NUMBER      object
HIRE_DATE         object
JOB_ID            object
SALARY             int64
COMMISSION_PCT    object
MANAGER_ID        object
DEPARTMENT_ID      int64
dtype: object

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           50 non-null     object
 4   PHONE_NUMBER    50 non-null     object
 5   HIRE_DATE       50 non-null     object
 6   JOB_ID          50 non-null     object
 7   SALARY          50 non-null     int64
 8   COMMISSION_PCT  50 non-null     object
 9   MANAGER_ID      50 non-null     object
 10  DEPARTMENT_ID   50 non-null     int64
dtypes: int64(3), object(8)
memory usage: 4.4+ KB

T3. Convert column JoinDate to datetime format.

In [ ]:
df1["HIRE_DATE"]=pd.to_datetime(df1["HIRE_DATE"])
df1.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20

T4. Convert column Department to category dtype.

In [30]:
df2=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\empdata.csv")

In [31]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100%,John,Doe,Engineering,Software Engineer,7500000%,4353900%,john.doe@example.com
1,10200%,Jane,Smith,Marketing,Marketing Manager,6800000%,4401300%,jane.smith@example.com
2,10300%,Michael,Brown,Engineering,Senior Developer,8800000%,4342400%,michael.brown@example.com
3,10400%,Linda,Johnson,HR,HR Executive,5500000%,4420600%,linda.johnson@example.com
4,10500%,Robert,Williams,Finance,Accountant,6200000%,4371300%,robert.williams@example.com

In [44]:
df2["Department"]=df2["Department"].astype("category")

In [67]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [61]:
df2["JoiningDate"]=pd.to_datetime(df2["JoiningDate"].astype("float"),unit="s")

In [66]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [64]:
df2["Salary"]=df2["Salary"].str.replace("%","",regex=False).astype("int64")

T5. Keep only columns: Name, Age, Department, Salary.

In [68]:
df2.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [ ]:
df2.drop(columns=["EmployeeID"],inplace=True)
df2.drop(columns=["Email"],inplace=True)

,FirstName,LastName,Department,Position,Salary,JoiningDate
0,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00
1,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00
2,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20
3,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40
4,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00

In [86]:
df2.drop(columns=["Position"],inplace=True)

In [87]:
df2.drop(columns=["JoiningDate"],inplace=True)

In [88]:
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

T6. Remove duplicate rows based on FirstName.

In [107]:
df2[df2.duplicated()]

Empty DataFrame
Columns: [FirstName, LastName, Department, Salary]
Index: []

In [106]:
df2.duplicated(subset=['FirstName', 'LastName'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [111]:
df2.drop_duplicates(subset=["FirstName"],inplace=True)
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

In [ ]:
df3=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\empdata.csv")

In [113]:
df1.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,-,201,20

In [114]:
df2.head()

  FirstName  LastName   Department   Salary
0      John       Doe  Engineering  7500000
1      Jane     Smith    Marketing  6800000
2   Michael     Brown  Engineering  8800000
3     Linda   Johnson           HR  5500000
4    Robert  Williams      Finance  6200000

In [128]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com

In [129]:
del df2

T7. Replace all NaN values in Salary with the columnâ€™s median.

In [132]:
import numpy as np  
salary=pd.Series(
    [1000,2000,4000,5000,np.nan,20000,np.nan]
)
salary

0     1000.0
1     2000.0
2     4000.0
3     5000.0
4        NaN
5    20000.0
6        NaN
dtype: float64

In [133]:
salary.fillna(salary.median())

0     1000.0
1     2000.0
2     4000.0
3     5000.0
4     4000.0
5    20000.0
6     4000.0
dtype: float64

T8. Create a new column SalaryLakh = Salary / 100000.

In [163]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

In [161]:
df3["Salarylakh"]=df3["Salary"]/100000

In [192]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

### ðŸŸ¦ SECTION 2 â€” FILTERING, INDEXING & SELECTION (8 Practical Tasks)

T9. Select all employees with Salarylakh >80.0.

In [170]:
df3.head()

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
4,10500,Robert,Williams,Finance,Accountant,6200000,1970-02-20 14:15:00,robert.williams@example.com,62.0

In [169]:
df3[df3["Salarylakh"]>80.0]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

T10. Select employees in Engineering OR HR department using .isin().

In [173]:
df3[df3["Department"].isin(["Engineering","HR"])]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
6,10700,David,Miller,Engineering,NaN,8000000,1970-02-20 16:41:40,david.miller@example.com,80.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
10,11100,Daniel,Taylor,Engineering,Software Engineer,7600000,1970-02-21 11:15:00,daniel.taylor@example.com,76.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

In [177]:
df3[(df3["Department"]=="HR")|(df3["Department"]=="Engineering")]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
2,10300,Michael,Brown,Engineering,Senior Developer,8800000,1970-02-20 06:13:20,michael.brown@example.com,88.0
3,10400,Linda,Johnson,HR,HR Executive,5500000,1970-02-21 03:56:40,linda.johnson@example.com,55.0
5,10600,Emily,Jones,Engineering,Data Scientist,9200000,1970-02-20 21:21:40,emily.jones@example.com,92.0
6,10700,David,Miller,Engineering,NaN,8000000,1970-02-20 16:41:40,david.miller@example.com,80.0
8,10900,Chris,Wilson,Engineering,DevOps Engineer,8700000,1970-02-20 03:51:40,chris.wilson@example.com,87.0
10,11100,Daniel,Taylor,Engineering,Software Engineer,7600000,1970-02-21 11:15:00,daniel.taylor@example.com,76.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0
12,11300,Matthew,Thomas,Engineering,Backend Developer,8100000,1970-02-21 01:15:00,matthew.thomas@example.com,81.0

T11. Select rows where Name starts with letter â€œJâ€.

In [190]:
df3[df3["FirstName"].str.startswith("J")]

,EmployeeID,FirstName,LastName,Department,Position,Salary,JoiningDate,Email,Salarylakh
0,10100,John,Doe,Engineering,Software Engineer,7500000,1970-02-20 09:25:00,john.doe@example.com,75.0
1,10200,Jane,Smith,Marketing,Marketing Manager,6800000,1970-02-20 22:35:00,jane.smith@example.com,68.0
11,11200,Jessica,Anderson,HR,Recruiter,5400000,1970-02-20 10:28:20,jessica.anderson@example.com,54.0

T12. Extract only columns from â€œAgeâ€ to â€œSalaryâ€ using .loc.

In [8]:
df1["Age"]=np.random.randint(26,60,50)

In [10]:
df1.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Age
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50,35
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50,40
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10,55
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20,41
4,202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20,57

In [18]:
df1.loc[:,["FIRST_NAME", "LAST_NAME", "EMAIL", "SALARY"]]

     FIRST_NAME    LAST_NAME     EMAIL  SALARY
0        Donald     OConnell  DOCONNEL    2600
1       Douglas        Grant    DGRANT    2600
2      Jennifer       Whalen   JWHALEN    4400
3       Michael    Hartstein  MHARTSTE   13000
4           Pat          Fay      PFAY    6000
5         Susan       Mavris   SMAVRIS    6500
6       Hermann         Baer     HBAER   10000
7       Shelley      Higgins  SHIGGINS   12008
8       William        Gietz    WGIETZ    8300
9        Steven         King     SKING   24000
10        Neena      Kochhar  NKOCHHAR   17000
11          Lex      De Haan   LDEHAAN   17000
12    Alexander       Hunold   AHUNOLD    9000
13        Bruce        Ernst    BERNST    6000
14        David       Austin   DAUSTIN    4800
15        Valli    Pataballa  VPATABAL    4800
16        Diana      Lorentz  DLORENTZ    4200
17        Nancy    Greenberg  NGREENBE   12008
18       Daniel       Faviet   DFAVIET    9000
19         John         Chen     JCHEN    8200
20       Ismael      Sciarra  ISCIARRA    7700
21  Jose Manuel        Urman   JMURMAN    7800
22         Luis         Popp     LPOPP    6900
23          Den     Raphaely  DRAPHEAL   11000
24    Alexander         Khoo     AKHOO    3100
25       Shelli        Baida    SBAIDA    2900
26        Sigal       Tobias   STOBIAS    2800
27          Guy       Himuro   GHIMURO    2600
28        Karen   Colmenares  KCOLMENA    2500
29      Matthew        Weiss    MWEISS    8000
30         Adam        Fripp    AFRIPP    8200
31        Payam     Kaufling  PKAUFLIN    7900
32       Shanta      Vollman  SVOLLMAN    6500
33        Kevin      Mourgos  KMOURGOS    5800
34        Julia        Nayer    JNAYER    3200
35        Irene  Mikkilineni  IMIKKILI    2700
36        James       Landry   JLANDRY    2400
37       Steven       Markle   SMARKLE    2200
38        Laura       Bissot   LBISSOT    3300
39        Mozhe     Atkinson  MATKINSO    2800
40        James       Marlow   JAMRLOW    2500
41           TJ        Olson   TJOLSON    2100
42        Jason       Mallin   JMALLIN    3300
43      Michael       Rogers   MROGERS    2900
44           Ki          Gee      KGEE    2400
45        Hazel   Philtanker  HPHILTAN    2200
46       Renske       Ladwig   RLADWIG    3600
47      Stephen       Stiles   SSTILES    3200
48         John          Seo      JSEO    2700
49       Joshua        Patel    JPATEL    2500

T13. Select rows 20 till 35 using .iloc.

In [21]:
df1.iloc[20:36,:]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Age
20,111,Ismael,Sciarra,ISCIARRA,515.124.4369,30-Sep-05,FI_ACCOUNT,7700,-,108,100,54
21,112,Jose Manuel,Urman,JMURMAN,515.124.4469,07-Mar-06,FI_ACCOUNT,7800,-,108,100,38
22,113,Luis,Popp,LPOPP,515.124.4567,07-Dec-07,FI_ACCOUNT,6900,-,108,100,53
23,114,Den,Raphaely,DRAPHEAL,515.127.4561,07-Dec-02,PU_MAN,11000,-,100,30,55
24,115,Alexander,Khoo,AKHOO,515.127.4562,18-May-03,PU_CLERK,3100,-,114,30,48
25,116,Shelli,Baida,SBAIDA,515.127.4563,24-Dec-05,PU_CLERK,2900,-,114,30,44
26,117,Sigal,Tobias,STOBIAS,515.127.4564,24-Jul-05,PU_CLERK,2800,-,114,30,58
27,118,Guy,Himuro,GHIMURO,515.127.4565,15-Nov-06,PU_CLERK,2600,-,114,30,52
28,119,Karen,Colmenares,KCOLMENA,515.127.4566,10-Aug-07,PU_CLERK,2500,-,114,30,32
29,120,Matthew,Weiss,MWEISS,650.123.1234,18-Jul-04,ST_MAN,8000,-,100,50,39
30,121,Adam,Fripp,AFRIPP,650.123.2234,10-Apr-05,ST_MAN,8200,-,100,50,46
31,122,Payam,Kaufling,PKAUFLIN,650.123.3234,01-May-03,ST_MAN,7900,-,100,50,40
32,123,Shanta,Vollman,SVOLLMAN,650.123.4234,10-Oct-05,ST_MAN,6500,-,100,50,50
33,124,Kevin,Mourgos,KMOURGOS,650.123.5234,16-Nov-07,ST_MAN,5800,-,100,50,51
34,125,Julia,Nayer,JNAYER,650.124.1214,16-Jul-05,ST_CLERK,3200,-,120,50,44
35,126,Irene,Mikkilineni,IMIKKILI,650.124.1224,28-Sep-06,ST_CLERK,2700,-,120,50,28

T14. Add a new column HighSalary = True if Salary > 15000 else False.

In [25]:
df1["SALARY_CAT"]=df1["SALARY"].apply(lambda a:"High" if a> 15000 else "Low")

T15. Remove all employees younger than 35 years old.

In [42]:
df1.shape

(47, 13)

In [41]:
df1=df1.drop(df1[df1["Age"]<30].index)

T16. Randomly select 10% of DataFrame rows.

In [45]:
df1.sample(frac=0.1)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Age,SALARY_CAT
48,139,John,Seo,JSEO,650.121.2019,12-Feb-06,ST_CLERK,2700,-,123,50,30,Low
34,125,Julia,Nayer,JNAYER,650.124.1214,16-Jul-05,ST_CLERK,3200,-,120,50,44,Low
43,134,Michael,Rogers,MROGERS,650.127.1834,26-Aug-06,ST_CLERK,2900,-,122,50,49,Low
36,127,James,Landry,JLANDRY,650.124.1334,14-Jan-07,ST_CLERK,2400,-,120,50,51,Low
21,112,Jose Manuel,Urman,JMURMAN,515.124.4469,07-Mar-06,FI_ACCOUNT,7800,-,108,100,38,Low

### ðŸŸ¦ SECTION 3 â€” GROUPBY, AGGREGATION & PIVOT TABLES (8 Practical Tasks)

T17. Find revenue per region.

In [2]:
import pandas as pd 
df2=pd.read_excel(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\Product-Sales-Region.xlsx")

In [47]:
df2.head()

,Date,Region,Product,Quantity,UnitPrice,StoreLocation,CustomerType,Discount,Salesperson,TotalPrice,PaymentMethod,Promotion,Returned,OrderID,CustomerName,ShippingCost,OrderDate,DeliveryDate,RegionManager
0,2023-02-23,East,Laptop,14,163.60,Store B,Wholesale,0.00,Eva,2290.400,Online,FREESHIP,0,REG100000,Cust 6583,43.34,2023-02-23,2023-02-27,Eric
1,2024-12-19,South,Phone,1,544.01,Store A,Retail,0.00,Alice,544.010,Gift Card,SAVE10,0,REG100001,Cust 2144,5.30,2024-12-19,2024-12-28,Sophie
2,2023-05-10,North,Desk,14,346.18,Store B,Wholesale,0.10,Alice,4361.868,Online,WINTER15,0,REG100002,Cust 5998,20.46,2023-05-10,2023-05-19,Ryan
3,2025-02-26,Central,Chair,18,384.82,Store A,Wholesale,0.15,Frank,5887.746,Gift Card,FREESHIP,0,REG100003,Cust 7136,27.95,2025-02-26,2025-03-02,Cameron
4,2023-06-24,East,Desk,18,237.76,Store C,Retail,0.00,Carlos,4279.680,Online,SAVE10,0,REG100004,Cust 6506,5.73,2023-06-24,2023-06-27,Eric

calculating the total revenue

In [9]:
df2["TotalRevenue"]=df2["TotalPrice"]-df2["ShippingCost"]

In [21]:
df2.groupby("Region").agg(Total_reveneue_by_region=("TotalRevenue","sum"))

         Total_reveneue_by_region
Region
Central               838759.1245
East                  874838.4080
North                 959954.9800
South                 819376.6570
West                  845802.3190

T18. Find: avg revenue, max revenue, min revenue per product category (one groupby).

In [ ]:
df2.groupby("Product").agg(
    avg_revenue=("TotalRevenue","mean"),
    max_revenue=("TotalRevenue","max"),
    min_revenue=("TotalRevenue","min")
)

         avg_revenue  max_revenue  min_revenue
Product
Chair    2953.376163    10316.480       8.8615
Desk     2655.143935     8895.834      15.6400
Laptop   2999.910626    10643.590      31.2020
Monitor  3046.260106    10505.360     -23.3800
Phone    2522.420415    11043.790      18.4990
Printer  3215.738083    10730.000     -36.0980
Tablet   2823.672565    10924.480      15.8720

T19. For each region, calculate: number of orders and total revenue.

In [25]:
df2.groupby("Region").agg(
    no_of_orders=("OrderID","count"),
    total_revenue=("TotalRevenue","sum")
)

         no_of_orders  total_revenue
Region
Central           301    838759.1245
East              311    874838.4080
North             309    959954.9800
South             295    819376.6570
West              284    845802.3190

T20. Group by CustomerID and list top 10 customers by total revenue.

In [34]:
df2.groupby("CustomerName").agg(
    Total_revenue=("TotalRevenue","sum"),
).sort_values(by="Total_revenue",ascending=False).head(10)

              Total_revenue
CustomerName
Cust 9159        17247.3940
Cust 1947        15995.4320
Cust 9397        13792.4410
Cust 2137        13606.8320
Cust 4240        12680.6940
Cust 6895        12228.3900
Cust 4715        12202.8800
Cust 1186        11733.3115
Cust 4101        11640.4760
Cust 5049        11220.6080

'T21. Create a pivot table:
Rows = City, Columns = Category â†’ values = sum of Quantity

In [4]:
pd.pivot_table(
    df2,
    index="Region",
    columns="Product",
    values="Quantity",
    aggfunc="sum"
)

Product  Chair  Desk  Laptop  Monitor  Phone  Printer  Tablet
Region
Central    381   433     485      446    290      489     578
East       378   398     528      364    539      456     415
North      489   581     418      523    353      515     563
South      482   256     544      345    495      446     385
West       392   358     433      499    293      430     636

T22. Calculate monthly total sales using groupby (not resample).

In [14]:
df2.groupby("month").agg(
    sales_in_month=("TotalPrice","sum")
)

           sales_in_month
month
April         443318.7265
August        289639.0035
December      262749.5220
February      415057.8135
January       498358.5015
July          280050.0475
June          434261.6690
March         532090.9535
May           402408.0255
November      283330.6200
October       256612.8970
September     282114.6490

T23. Sort categories by highest average revenue.

In [20]:
df2.groupby("Product").agg(
    Avg_revenue=("TotalRevenue","mean")
).sort_values(by="Avg_revenue",ascending=True)

         Avg_revenue
Product
Phone    2522.420415
Desk     2655.143935
Tablet   2823.672565
Chair    2953.376163
Laptop   2999.910626
Monitor  3046.260106
Printer  3215.738083

T24. After grouping by Category, convert the output to a DataFrame with proper column names.

In [35]:
data=df2.groupby("Product").agg(
    Total_revenue=("TotalRevenue","sum")
)
data

         Total_revenue
Product
Chair      617255.6180
Desk       549614.7945
Laptop     677979.8015
Monitor    645807.1425
Phone      491871.9810
Printer    678520.7355
Tablet     677681.4155

### ðŸŸ¦ SECTION 4 â€” MERGE, JOIN & CONCAT (6 Practical Tasks)

T25. Perform INNER JOIN

In [44]:
df1=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\powerlifting_dataset\openpowerlifting.csv")

In [45]:
df1.head()

,MeetID,Name,Sex,Equipment,Age,Division,BodyweightKg,WeightClassKg,Squat4Kg,BestSquatKg,Bench4Kg,BestBenchKg,Deadlift4Kg,BestDeadliftKg,TotalKg,Place,Wilks
0,0,Angie Belk Terry,F,Wraps,47.0,Mst 45-49,59.60,60,NaN,47.63,NaN,20.41,NaN,70.31,138.35,1,155.05
1,0,Dawn Bogart,F,Single-ply,42.0,Mst 40-44,58.51,60,NaN,142.88,NaN,95.25,NaN,163.29,401.42,1,456.38
2,0,Dawn Bogart,F,Single-ply,42.0,Open Senior,58.51,60,NaN,142.88,NaN,95.25,NaN,163.29,401.42,1,456.38
3,0,Dawn Bogart,F,Raw,42.0,Open Senior,58.51,60,NaN,NaN,NaN,95.25,NaN,NaN,95.25,1,108.29
4,0,Destiny Dula,F,Raw,18.0,Teen 18-19,63.68,67.5,NaN,NaN,NaN,31.75,NaN,90.72,122.47,1,130.47

In [46]:
df2=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\powerlifting_dataset\meets.csv")

In [47]:
df2.head()

,MeetID,MeetPath,Federation,Date,MeetCountry,MeetState,MeetTown,MeetName
0,0,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
1,1,365strong/1602,365Strong,2016-11-19,USA,MO,Ozark,Thanksgiving Powerlifting Classic
2,2,365strong/1603,365Strong,2016-07-09,USA,NC,Charlotte,Charlotte Europa Games
3,3,365strong/1604,365Strong,2016-06-11,USA,SC,Rock Hill,Carolina Cup Push Pull Challenge
4,4,365strong/1605,365Strong,2016-04-10,USA,SC,Rock Hill,Eastern USA Challenge

In [51]:
df1.join(
  df2.set_index("MeetID"),
  on=("MeetID"),
  how="inner"  
)

,MeetID,Name,Sex,Equipment,Age,Division,BodyweightKg,WeightClassKg,Squat4Kg,BestSquatKg,...,TotalKg,Place,Wilks,MeetPath,Federation,Date,MeetCountry,MeetState,MeetTown,MeetName
0,0,Angie Belk Terry,F,Wraps,47.0,Mst 45-49,59.60,60,NaN,47.63,...,138.35,1,155.05,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
1,0,Dawn Bogart,F,Single-ply,42.0,Mst 40-44,58.51,60,NaN,142.88,...,401.42,1,456.38,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
2,0,Dawn Bogart,F,Single-ply,42.0,Open Senior,58.51,60,NaN,142.88,...,401.42,1,456.38,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
3,0,Dawn Bogart,F,Raw,42.0,Open Senior,58.51,60,NaN,NaN,...,95.25,1,108.29,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
4,0,Destiny Dula,F,Raw,18.0,Teen 18-19,63.68,67.5,NaN,NaN,...,122.47,1,130.47,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
386409,8481,William Barabas,M,Multi-ply,NaN,Elite,113.58,125,NaN,NaN,...,347.50,2,202.60,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386410,8481,Justin Zottl,M,Multi-ply,NaN,Elite,119.02,125,NaN,NaN,...,322.50,3,185.77,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386411,8481,Jake Anderson,M,Multi-ply,NaN,Elite,120.29,125,NaN,NaN,...,367.50,1,211.17,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386412,8481,Jeff Bumanglag,M,Multi-ply,NaN,Elite,126.73,140,NaN,NaN,...,320.00,3,181.85,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386413,8481,Shane Hammock,M,Multi-ply,NaN,Elite,129.46,140,NaN,NaN,...,362.50,2,205.18,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals

T26. Perform LEFT JOIN

In [52]:
df1.join(
    df2.set_index("MeetID"),on="MeetID",how="left"
)

,MeetID,Name,Sex,Equipment,Age,Division,BodyweightKg,WeightClassKg,Squat4Kg,BestSquatKg,...,TotalKg,Place,Wilks,MeetPath,Federation,Date,MeetCountry,MeetState,MeetTown,MeetName
0,0,Angie Belk Terry,F,Wraps,47.0,Mst 45-49,59.60,60,NaN,47.63,...,138.35,1,155.05,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
1,0,Dawn Bogart,F,Single-ply,42.0,Mst 40-44,58.51,60,NaN,142.88,...,401.42,1,456.38,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
2,0,Dawn Bogart,F,Single-ply,42.0,Open Senior,58.51,60,NaN,142.88,...,401.42,1,456.38,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
3,0,Dawn Bogart,F,Raw,42.0,Open Senior,58.51,60,NaN,NaN,...,95.25,1,108.29,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
4,0,Destiny Dula,F,Raw,18.0,Teen 18-19,63.68,67.5,NaN,NaN,...,122.47,1,130.47,365strong/1601,365Strong,2016-10-29,USA,NC,Charlotte,2016 Junior & Senior National Powerlifting Cha...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
386409,8481,William Barabas,M,Multi-ply,NaN,Elite,113.58,125,NaN,NaN,...,347.50,2,202.60,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386410,8481,Justin Zottl,M,Multi-ply,NaN,Elite,119.02,125,NaN,NaN,...,322.50,3,185.77,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386411,8481,Jake Anderson,M,Multi-ply,NaN,Elite,120.29,125,NaN,NaN,...,367.50,1,211.17,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386412,8481,Jeff Bumanglag,M,Multi-ply,NaN,Elite,126.73,140,NaN,NaN,...,320.00,3,181.85,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals
386413,8481,Shane Hammock,M,Multi-ply,NaN,Elite,129.46,140,NaN,NaN,...,362.50,2,205.18,xpc/2017-finals,XPC,2017-03-03,USA,OH,Columbus,2017 XPC Finals

T27. Concatenate two DataFrames vertically.

In [77]:
df3=pd.concat([df1,df2],axis=0)

T28. Concatenate two DataFrames horizontally.

In [80]:
df3=pd.concat(
    [df1,df2],axis=1
)

T29. Merge orders & customers on two keys: City & State.

In [85]:
df1=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\orders.csv")

In [86]:
df2=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\customers.csv")

In [94]:
df3=pd.merge(df1,df2,how='inner')
df3

   OrderID  CustomerID      City State  OrderAmount CustomerName
0      101           1    Mumbai    MH         5000         Amit
1      102           2     Delhi    DL         7000         Riya
2      103           3  New York    NY        12000         John
3      104           4    London    LN         9000         Sara
4      105           5     Seoul    KR        15000          Lee

T30. After merging, drop all duplicate rows based on OrderID.

In [95]:
df1=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\customers.csv")

In [96]:
df2=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\orders.csv")

In [114]:
df3=pd.merge(df1,df2,how="inner")
df3

    CustomerID CustomerName      City State  OrderID  OrderAmount
0            1         Amit    Mumbai    MH      101         5000
1            2         Riya     Delhi    DL      102         7000
2            2         Riya     Delhi    DL      102         7000
3            3         John  New York    NY      103        12000
4            3         John  New York    NY      103        12000
5            4         Sara    London    LN      104         9000
6            4         Sara    London    LN      104         9000
7            5          Lee     Seoul    KR      105        15000
8            3         John  New York    NY      103        12000
9            3         John  New York    NY      103        12000
10           4         Sara    London    LN      104         9000
11           4         Sara    London    LN      104         9000
12           5          Lee     Seoul    KR      105        15000

In [116]:
df3.drop_duplicates("OrderID",keep="first")

   CustomerID CustomerName      City State  OrderID  OrderAmount
0           1         Amit    Mumbai    MH      101         5000
1           2         Riya     Delhi    DL      102         7000
3           3         John  New York    NY      103        12000
5           4         Sara    London    LN      104         9000
7           5          Lee     Seoul    KR      105        15000

### ðŸŸ¦ SECTION 5 â€” DATA CLEANING & TRANSFORMATION (6 Practical Tasks)

T31. Identify numeric outliers in column Amount using IQR and remove them.

In [57]:
import pandas as pd
import numpy as np

# Seed for reproducibility
np.random.seed(42)

# Generate normal salary data (most salaries between 40k and 80k)
normal_salaries = np.random.randint(40000, 80000, size=20)

# Add some extreme outliers
outliers = np.array([200000, 250000, 300000])

# Combine normal salaries with outliers
salaries = np.concatenate([normal_salaries, outliers])

# Create employee names
employees = [f"Emp_{i+1}" for i in range(len(salaries))]

# Create DataFrame
df = pd.DataFrame({
    "Employee": employees,
    "Salary": salaries
})
df

   Employee  Salary
0     Emp_1   55795
1     Emp_2   40860
2     Emp_3   78158
3     Emp_4   51284
4     Emp_5   46265
5     Emp_6   56850
6     Emp_7   77194
7     Emp_8   61962
8     Emp_9   56023
9    Emp_10   41685
10   Emp_11   40769
11   Emp_12   42433
12   Emp_13   45311
13   Emp_14   77819
14   Emp_15   79188
15   Emp_16   57568
16   Emp_17   59769
17   Emp_18   68693
18   Emp_19   46396
19   Emp_20   67480
20   Emp_21  200000
21   Emp_22  250000
22   Emp_23  300000

In [13]:
df['Salary'].count()

np.int64(23)

In [28]:
q1=df['Salary'].quantile(0.25)
q1

np.float64(46330.5)

In [29]:
q3=df["Salary"].quantile(0.75)
q3

np.float64(77506.5)

In [30]:
iqr=q3-q1
iqr

np.float64(31176.0)

In [31]:
lb=q1-1.5*iqr
lb

np.float64(-433.5)

In [32]:
ub=q3+1.5*iqr
ub

np.float64(124270.5)

In [63]:
df=df[~((df["Salary"]<=lb)|(df["Salary"]>=ub))]

In [64]:
df

   Employee  Salary
0     Emp_1   55795
1     Emp_2   40860
2     Emp_3   78158
3     Emp_4   51284
4     Emp_5   46265
5     Emp_6   56850
6     Emp_7   77194
7     Emp_8   61962
8     Emp_9   56023
9    Emp_10   41685
10   Emp_11   40769
11   Emp_12   42433
12   Emp_13   45311
13   Emp_14   77819
14   Emp_15   79188
15   Emp_16   57568
16   Emp_17   59769
17   Emp_18   68693
18   Emp_19   46396
19   Emp_20   67480

T32. Split column FullName into FirstName and LastName.

In [73]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\employees_dataset\employees.csv")

In [78]:
df["FULL_NAME"]=df["FIRST_NAME"]+" "+df["LAST_NAME"]

In [80]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,FULL_NAME
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50,Donald OConnell
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50,Douglas Grant
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10,Jennifer Whalen
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20,Michael Hartstein
4,202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20,Pat Fay

In [89]:
df[["FIRST","LAST"]]=df['FULL_NAME'].str.split(" ",n=1,expand=True)

In [91]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,FULL_NAME,FIRST,LAST
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50,Donald OConnell,Donald,OConnell
1,199,Douglas,Grant,DGRANT,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50,Douglas Grant,Douglas,Grant
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10,Jennifer Whalen,Jennifer,Whalen
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20,Michael Hartstein,Michael,Hartstein
4,202,Pat,Fay,PFAY,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20,Pat Fay,Pat,Fay

T33. Create a new column:

In [92]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\SALE_SAMPLE.csv")

In [96]:
df.head()

   S.No  Cost Price (â‚¹/kg)  Sale Price (â‚¹/kg)
0     1               42.5               48.0
1     2               43.2               49.0
2     3               41.8               47.5
3     4               44.0               50.0
4     5               42.9               48.5

In [97]:
df["Profit"]=df["Sale Price (â‚¹/kg)"]-df["Cost Price (â‚¹/kg)"]

In [98]:
df.head()

   S.No  Cost Price (â‚¹/kg)  Sale Price (â‚¹/kg)  Profit
0     1               42.5               48.0     5.5
1     2               43.2               49.0     5.8
2     3               41.8               47.5     5.7
3     4               44.0               50.0     6.0
4     5               42.9               48.5     5.6

T34. Apply a lambda to clean all text columns by stripping spaces.

In [103]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\Hr analytics dataset\hr_analytics_dataset.csv")

In [112]:
df[df.select_dtypes(include="object").columns]=df.select_dtypes(include="object").apply(lambda x: x.str.strip())

In [113]:
df.head()

,employee_id,age,gender,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,1001,50,Female,IT,Analyst,High School,2020,10,201048,1,No,Married,No,Poor,2
1,1002,36,Female,R&D,Executive,High School,2010,12,199668,3,No,Single,Yes,Good,10
2,1003,29,Female,Sales,Executive,Bachelors,2012,16,179243,1,No,Divorced,Yes,Excellent,1
3,1004,42,Male,IT,Lead,PhD,2022,7,111365,3,No,Married,Yes,Average,2
4,1005,40,Male,Sales,Specialist,PhD,2016,20,139014,5,No,Single,Yes,Excellent,5

T35. Rename multiple columns at once using a dictionary.

In [114]:
df.head()

,employee_id,age,gender,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,1001,50,Female,IT,Analyst,High School,2020,10,201048,1,No,Married,No,Poor,2
1,1002,36,Female,R&D,Executive,High School,2010,12,199668,3,No,Single,Yes,Good,10
2,1003,29,Female,Sales,Executive,Bachelors,2012,16,179243,1,No,Divorced,Yes,Excellent,1
3,1004,42,Male,IT,Lead,PhD,2022,7,111365,3,No,Married,Yes,Average,2
4,1005,40,Male,Sales,Specialist,PhD,2016,20,139014,5,No,Single,Yes,Excellent,5

In [126]:
df.rename(columns={"age":"AGE",
                   "gender":"GENDER"},inplace=True)

In [127]:
df.head()

,employee_id,AGE,GENDER,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,1001,50,Female,IT,Analyst,High School,2020,10,201048,1,No,Married,No,Poor,2
1,1002,36,Female,R&D,Executive,High School,2010,12,199668,3,No,Single,Yes,Good,10
2,1003,29,Female,Sales,Executive,Bachelors,2012,16,179243,1,No,Divorced,Yes,Excellent,1
3,1004,42,Male,IT,Lead,PhD,2022,7,111365,3,No,Married,Yes,Average,2
4,1005,40,Male,Sales,Specialist,PhD,2016,20,139014,5,No,Single,Yes,Excellent,5

T36. Scale all numeric columns using (value - min) / (max - min).

In [141]:
df[df.select_dtypes(include="number").columns]=df.select_dtypes(include="number").apply(lambda x: x-x.min()/x.max()-x.min())

In [142]:
df.head()

,employee_id,AGE,GENDER,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,-0.77,27.627119,Female,IT,Analyst,High School,14.008898,10.0,175840.898724,-0.2,No,Married,No,Poor,0.9
1,0.23,13.627119,Female,R&D,Executive,High School,4.008898,12.0,174460.898724,1.8,No,Single,Yes,Good,8.9
2,1.23,6.627119,Female,Sales,Executive,Bachelors,6.008898,16.0,154035.898724,-0.2,No,Divorced,Yes,Excellent,-0.1
3,2.23,19.627119,Male,IT,Lead,PhD,16.008898,7.0,86157.898724,1.8,No,Married,Yes,Average,0.9
4,3.23,17.627119,Male,Sales,Specialist,PhD,10.008898,20.0,113806.898724,3.8,No,Single,Yes,Excellent,3.9

### ðŸŸ¦ SECTION 6 â€” TIME SERIES OPERATIONS (4 Practical Tasks)

T37. Extract Year, Month, Week, Day from OrderDate.

In [143]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\bikestore_dataset\orders.csv")

In [144]:
df.head()

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6

In [145]:
df.shape

(1615, 8)

In [147]:
df["order_date"]=pd.to_datetime(df["order_date"])

In [153]:
df["orderyear"]=df["order_date"].dt.year

In [182]:
df.head()

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,orderyear,ordermonth,Weekofyear,weekday
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,2016,January,53,Friday
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6,2016,January,53,Friday
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7,2016,January,53,Saturday
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3,2016,January,53,Sunday
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6,2016,January,53,Sunday

In [158]:
df["ordermonth"]=df["order_date"].dt.month_name()

In [173]:
df["Weekofyear"]=df["order_date"].dt.isocalendar().week

In [181]:
df["weekday"]=df["order_date"].dt.day_name()

T38. Filter all orders placed in year 2018

In [184]:
df[df["orderyear"]==2018]

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,orderyear,ordermonth,Weekofyear,weekday
1323,1324,862,4,2018-01-01,2018-01-04,2018-01-03,2,6,2018,January,1,Monday
1324,1325,68,4,2018-01-01,2018-01-02,2018-01-03,3,8,2018,January,1,Monday
1325,1326,567,4,2018-01-01,2018-01-03,2018-01-02,3,9,2018,January,1,Monday
1326,1327,1026,4,2018-01-02,2018-01-03,2018-01-05,2,6,2018,January,1,Tuesday
1327,1328,1083,4,2018-01-02,2018-01-03,2018-01-03,2,6,2018,January,1,Tuesday
...,...,...,...,...,...,...,...,...,...,...,...,...
1610,1611,6,3,2018-09-06,2018-09-06,NaN,2,7,2018,September,36,Thursday
1611,1612,3,3,2018-10-21,2018-10-21,NaN,1,3,2018,October,42,Sunday
1612,1613,1,3,2018-11-18,2018-11-18,NaN,2,6,2018,November,46,Sunday
1613,1614,135,3,2018-11-28,2018-11-28,NaN,3,8,2018,November,48,Wednesday
1614,1615,136,3,2018-12-28,2018-12-28,NaN,3,8,2018,December,52,Friday

T39. Resample sales monthly and compute total revenue.

In [186]:
df=pd.read_excel(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\Product-Sales-Region.xlsx")

In [194]:
df.head()

,Date,Region,Product,Quantity,UnitPrice,StoreLocation,CustomerType,Discount,Salesperson,TotalPrice,...,Promotion,Returned,OrderID,CustomerName,ShippingCost,OrderDate,DeliveryDate,RegionManager,TotalSale,OrderMonth
0,2023-02-23,East,Laptop,14,163.60,Store B,Wholesale,0.00,Eva,2290.400,...,FREESHIP,0,REG100000,Cust 6583,43.34,2023-02-23,2023-02-27,Eric,2247.060,February
1,2024-12-19,South,Phone,1,544.01,Store A,Retail,0.00,Alice,544.010,...,SAVE10,0,REG100001,Cust 2144,5.30,2024-12-19,2024-12-28,Sophie,538.710,December
2,2023-05-10,North,Desk,14,346.18,Store B,Wholesale,0.10,Alice,4361.868,...,WINTER15,0,REG100002,Cust 5998,20.46,2023-05-10,2023-05-19,Ryan,4341.408,May
3,2025-02-26,Central,Chair,18,384.82,Store A,Wholesale,0.15,Frank,5887.746,...,FREESHIP,0,REG100003,Cust 7136,27.95,2025-02-26,2025-03-02,Cameron,5859.796,February
4,2023-06-24,East,Desk,18,237.76,Store C,Retail,0.00,Carlos,4279.680,...,SAVE10,0,REG100004,Cust 6506,5.73,2023-06-24,2023-06-27,Eric,4273.950,June

In [191]:
df.shape

(1500, 20)

In [190]:
df["TotalSale"]=df["TotalPrice"]-df["ShippingCost"]

In [193]:
df["OrderMonth"]=df["OrderDate"].dt.month_name()

In [197]:
df.groupby("OrderMonth").agg(
    total_revenuw=("TotalSale","sum")
).round(2)

            total_revenuw
OrderMonth
April           439274.50
August          287078.62
December        260462.79
February        410859.85
January         493240.63
July            277153.05
June            430060.92
March           527459.76
May             398630.81
November        280539.44
October         254276.24
September       279694.88

T40. Calculate days difference between consecutive transactions for each customer.

In [208]:
import pandas as pd

data = {
    "CustomerID": [1, 1, 2, 1, 2, 3],
    "OrderID": [101, 102, 201, 103, 202, 301],
    "OrderDate": [
        "2025-12-01",
        "2025-12-05",
        "2025-12-02",
        "2025-12-10",
        "2025-12-08",
        "2025-12-03"
    ],
    "Revenue": [500, 700, 200, 300, 400, 600]
}

df = pd.DataFrame(data)
df['OrderDate'] = pd.to_datetime(df['OrderDate'])

df

   CustomerID  OrderID  OrderDate  Revenue
0           1      101 2025-12-01      500
1           1      102 2025-12-05      700
2           2      201 2025-12-02      200
3           1      103 2025-12-10      300
4           2      202 2025-12-08      400
5           3      301 2025-12-03      600

In [209]:
df=df.sort_values(["CustomerID","OrderDate"])

In [212]:
df

   CustomerID  OrderID  OrderDate  Revenue  iddintran
0           1      101 2025-12-01      500        NaN
1           1      102 2025-12-05      700        4.0
3           1      103 2025-12-10      300        5.0
2           2      201 2025-12-02      200        NaN
4           2      202 2025-12-08      400        6.0
5           3      301 2025-12-03      600        NaN

In [211]:
df["iddintran"]=df.groupby("CustomerID")["OrderDate"].diff().dt.days

### â­ SECTION 7 â€” FULL REAL-WORLD ANALYSIS PROJECT
- Dataset: ecommerce.csv 
- Columns: OrderID, CustomerID, Category, SubCategory, Quantity, Amount, Discount, Date, City, State, PaymentMode

### Load dataset
- loaded the data set which contains the required columns and saw the sample data its shape and columns

In [252]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\sales_dataset\ecommerce_sales_data.csv")

In [253]:
df.head()

,Order ID,Customer ID,Gender,Age,Product Category,Product Name,Quantity,Price,Order Date,Payment Method,City,Rating
0,ORD0001,CUST9376,Female,43,Home,Lamp,1,1368.69,07-06-2025,Cash on Delivery,Hyderabad,3
1,ORD0002,CUST3289,Male,57,Toys,Lego Set,5,782.44,11-12-2024,Cash on Delivery,Chennai,5
2,ORD0003,CUST6409,Female,53,Clothing,Jacket,1,3676.18,05-05-2025,Credit Card,Bangalore,4
3,ORD0004,CUST8815,Female,51,Beauty,Perfume,2,4836.37,25-06-2025,Cash on Delivery,Mumbai,5
4,ORD0005,CUST1018,Female,39,Electronics,Smartphone,4,3580.24,25-12-2024,UPI,Kolkata,3

In [215]:
df.shape

(100, 12)

In [216]:
df.columns

Index(['Order ID', 'Customer ID', 'Gender', 'Age', 'Product Category',
       'Product Name', 'Quantity', 'Price', 'Order Date', 'Payment Method',
       'City', 'Rating'],
      dtype='object')

### Handle missing values appropriately
- checked info no missing values to handle

In [217]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          100 non-null    object
 1   Customer ID       100 non-null    object
 2   Gender            100 non-null    object
 3   Age               100 non-null    int64
 4   Product Category  100 non-null    object
 5   Product Name      100 non-null    object
 6   Quantity          100 non-null    int64
 7   Price             100 non-null    float64
 8   Order Date        100 non-null    object
 9   Payment Method    100 non-null    object
 10  City              100 non-null    object
 11  Rating            100 non-null    int64
dtypes: float64(1), int64(3), object(8)
memory usage: 9.5+ KB

### Remove outliers from Amount
- checked the data set and there are no outliers

In [219]:
q1=df["Price"].quantile(0.25)
q1

np.float64(1130.615)

In [221]:
q3=df["Price"].quantile(0.75)
q3

np.float64(3743.8725)

In [223]:
iqr=q3-q1
iqr

np.float64(2613.2574999999997)

In [224]:
lb=q1-1.5*iqr
lb

np.float64(-2789.27125)

In [225]:
ub=q3+1.5*iqr
ub

np.float64(7663.758749999999)

In [229]:
df[(df["Price"]<lb)| (df["Price"]>ub)]

Empty DataFrame
Columns: [Order ID, Customer ID, Gender, Age, Product Category, Product Name, Quantity, Price, Order Date, Payment Method, City, Rating]
Index: []

### Create NetAmount = Amount - Discount

In [243]:
df.head(3)

,Order ID,Customer ID,Gender,Age,Product Category,Product Name,Quantity,Price,Order Date,Payment Method,City,Rating,Discount,TotalAmount,DiscountPrice,NetAmount
0,ORD0001,CUST9376,Female,43,Home,Lamp,1,1368.69,07-06-2025,Cash on Delivery,Hyderabad,3,0.00,1368.69,0.000,1368.690
1,ORD0002,CUST3289,Male,57,Toys,Lego Set,5,782.44,11-12-2024,Cash on Delivery,Chennai,5,0.05,3912.20,195.610,3716.590
2,ORD0003,CUST6409,Female,53,Clothing,Jacket,1,3676.18,05-05-2025,Credit Card,Bangalore,4,0.10,3676.18,367.618,3308.562

In [254]:
discount = pd.Series([
0,5,10,0,15,20,5,0,10,25,30,0,5,10,15,0,20,25,5,0,
10,35,40,0,5,15,20,10,0,25,30,5,0,10,15,20,0,5,
25,30,10,0,15,20,5,0,10,25,30,0,35,40,5,0,10,15,
20,0,25,30,5,0,10,15,20,0,25,30,35,40,45,0,5,10,
15,20,25,2,2,3,4,5,6,7,8,9,4,3,2,2,3,30,35,40,45,50,30,10,12,3
])
Discount=discount/100

In [255]:
df["Discount"]=Discount

In [256]:
df["TotalAmount"]=df["Quantity"]*df["Price"]

In [257]:
df["DiscountPrice"]=df["TotalAmount"]*df["Discount"]

In [258]:
df["NetAmount"]=df["TotalAmount"]-df["DiscountPrice"]

### Create city-wise total sales table

In [262]:
df=df.rename(columns={
    "NetAmount":"TotalSales"
})

In [260]:
df["City"].value_counts()

City
Chennai      22
Mumbai       20
Kolkata      20
Hyderabad    15
Bangalore    14
Delhi         9
Name: count, dtype: int64

In [278]:
df2=df.groupby("City")["TotalSales"].sum()
df2.round(2)

City
Bangalore     80254.21
Chennai       91408.43
Delhi         47307.94
Hyderabad    107702.63
Kolkata      170794.88
Mumbai       110991.94
Name: TotalSales, dtype: float64